app/controllers/cars_controller.rb

INSERT INTO "cars" ("mileage", "year", "color", "description", "manufacturer_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["mileage", 3], ["year", 1933], ["color", "Ruby Red"], ["description", "Thing of beauty."], ["manufacturer_id", 7]]
---
  def create
    @car = Car.new(car_params)
    if @car.save

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT 1  [["id", 18]]
UPDATE "cars" SET "year" = $1, "color" = $2, "description" = $3 WHERE "cars"."id" = $4  [["year", 2033], ["color", "Midnight Black"], ["description", "Thing of beauty."], ["id", 18]]
---
  def update
    @car = Car.find(params[:id])
    if @car.update(car_params)

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 6]]
---
  def destroy
    @car = Car.find(params[:id])
    if @car.destroy