app/controllers/manufacturers_controller.rb

SELECT "manufacturers".* FROM "manufacturers"  ORDER BY name
---
  def index
    @manufacturers = Manufacturer.order("name")

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 22]]
---
  def show
    @manufacturer = Manufacturer.find(params[:id])

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 99]]
---
  def edit
    @manufacturer = Manufacturer.find(params[:id])

INSERT INTO "manufacturers" ("name", "country") VALUES ($1, $2) RETURNING "id"  [["name", "Tesla"], ["country", "USA"]]
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 99]]
UPDATE "manufacturers" SET "name" = $1 WHERE "manufacturers"."id" = $2  [["name", "BMWW"], ["id", 1]]
---
  def update
    @manufacturer = Manufacturer.find(params[:id])
    if @manufacturer.update(manufacturer_params)

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 27]]
DELETE FROM "manufacturers" WHERE "manufacturers"."id" = $1  [["id", 27]]
---
  def destroy
    @manufacturer = Manufacturer.find(params[:id])
    if @manufacturer.destroy