app/views/cars/_form.html.erb

        <%= f.label :manufacturer_id %>
        <%= f.select :manufacturer_id, options_from_collection_for_select(Manufacturer.all, :id, :name) %>
---
SELECT "manufacturers".* FROM "manufacturers"